<template>  
    <h1>Добро пожаловать</h1>
    <p>ToDo лист с разным подходом реализации с помощью vue js. Посты отрисовываются через запрос на сервер, так же можно через модальное окно добавлять свой пост, удалять пост и открывать детальну страницую поста.</p>
    <ul>
        <li>Реализация загрузки постов через пагинацию и отрисовка определенного количества постов на странице</li>
        <li>Реализация загрузки постов через обсервер (автозагрузка на определенном элементе в зоне видимости экрана)</li>
        <li>Реализация страницы с постами через vuex</li>
        <li>Реализация страницы с постами через composition api</li>
        <li>Двустороение связывание модели и представления</li>
        <li>Реактивность</li>
        <li>Создание и использывание своей директивы (Фокус и обсервер)</li>
        <li>Использывание миксинов</li>
        <li>Реализован роутинг по приложению</li>
        <li>Возможность сортировать посты с помощью поиска, по id поста, по названию поста и его описанию</li>
    </ul>
</template>

<script>
    export default{
        
    }
</script>

<style scoped>
    li{
        list-style: disc;
        margin: 10px 0;
    }

    li:last-child{
        margin: 0;
    }

    p{
        margin: 15px 0;
    }
</style>